#Использовать asserts

#Использовать ".."



Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРаботоСпособностьКласса");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьПростуюИнициализациюКласса");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьИнициализациюКласса");
	
	Возврат ВсеТесты;
КонецФункции



Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРаботоСпособностьКласса() Экспорт
	
	строка = "Привет, мир";
	Конвертер = Новый Конвертер();
	Результат =  Конвертер.Echo(строка);
	Ожидаем.Что(Результат, "Ожидаем, что строки равны").Равно(строка);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьПростуюИнициализациюКласса() Экспорт
	Эталон = 1;
	Конвертер = Новый Конвертер();
	Результат = Конвертер.ПолучитьЗначение();
	Ожидаем.Что(Результат, "Ожидаем, что значение по умолчанию равно 1").Равно(Эталон);



КонецПроцедуры

Процедура ТестДолжен_ПроверитьИнициализациюКласса() Экспорт
	
	ВызватьИсключение "Не реализовано";

КонецПроцедуры


