#Использовать asserts

#Использовать ".."



Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРазмерностьБита");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРазмерностьБайта");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРазмерностьКилобайта");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРазмерностьМегабайта");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРазмерностьГигабайта");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРазмерностьТерабайта");
	Возврат ВсеТесты;
	
КонецФункции



Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры



Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРазмерностьБита() Экспорт
	
	ЭталонБит =  1;
	Результат = ЕдиницыИзмерений.Бит;
	Ожидаем.Что(Результат, "Ожидаем, что 1 бйт = 1").Равно(ЭталонБит);

КонецПроцедуры


Процедура ТестДолжен_ПроверитьРазмерностьБайта() Экспорт
	
	ЭталонБит =  8;
	Результат = ЕдиницыИзмерений.Байт;
	Ожидаем.Что(Результат, "Ожидаем, что 1 Байт = 8 Бит").Равно(ЭталонБит);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРазмерностьКилобайта() Экспорт
	
	ЭталонБит =  8192;
	Результат = ЕдиницыИзмерений.Килобайт;
	Ожидаем.Что(Результат, "Ожидаем, что 1 Килобайт = 8192 Бит").Равно(ЭталонБит);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРазмерностьМегабайта() Экспорт
	
	ЭталонБит =  8388608;
	Результат = ЕдиницыИзмерений.Мегабайт;
	Ожидаем.Что(Результат, "Ожидаем, что 1 Мегабайт = 8388608 Бит").Равно(ЭталонБит);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРазмерностьГигабайта() Экспорт
	
	ЭталонБит =  8589934592;
	Результат = ЕдиницыИзмерений.Гигабайт;
	Ожидаем.Что(Результат, "Ожидаем, что 1 Гигабайт = 8589934592 Бит").Равно(ЭталонБит);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьРазмерностьТерабайта() Экспорт
	
	ЭталонБит =  8796093022208;
	Результат = ЕдиницыИзмерений.Терабайт;
	Ожидаем.Что(Результат, "Ожидаем, что 1 Терабайт = 8796093022208 Бит").Равно(ЭталонБит);

КонецПроцедуры