#Использовать asserts

#Использовать ".."



Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьРаботоСпособностьКласса");
	
	Возврат ВсеТесты;
КонецФункции



Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры



Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьРаботоСпособностьКласса() Экспорт
	
	строка = "Привет, мир";
	Конвертер = Новый Конвертер();
	Результат =  Конвертер.Echo(строка);
	Ожидаем.Что(Результат, "Ожидаем, что 2 + 2 = 4").Равно(строка);
КонецПроцедуры

