#Использовать asserts

#Использовать ".."

 

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

    ВсеТесты = Новый Массив;    
    ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтоДваПлюсДваРавноЧетыре");
    Возврат ВсеТесты;
КонецФункции

 

Процедура ПередЗапускомТеста() Экспорт

КонецПроцедуры

 

Процедура ПослеЗапускаТеста() Экспорт

КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоДваПлюсДваРавноЧетыре() Экспорт
    Результат = Вычислитель.Сложить(2, 2);
    Ожидаем.Что(Результат, "Ожидаем, что 2 + 2 = 4").Равно(4);
КонецПроцедуры